app/controllers/partners_controller.rb

SELECT * FROM "partners" WHERE (published = 't')
---
  def index
    conditions = Array.new
    if !current_user
      conditions = ["published = ?", "t"]
    end
    @partners = Partner.all(:conditions => conditions).reverse.paginate :page => params[:page]

SELECT * FROM "partners" WHERE ("partners"."id" = 1)
---
  def show
    @partner = Partner.find(params[:id])

INSERT INTO "partners" ("name", "created_at", "updated_at", "url", "description") VALUES('Libre Informatique', '2010-03-17 15:15:31', '2010-03-17 15:15:31', 'http://libre-informatique.org', 'zcsdvzes zef *dsfze* zefzef')
---
  def create
    @partner = Partner.new(params[:partner])
    if @partner.save

SELECT * FROM "partners" WHERE ("partners"."id" = 1)
---
  def edit
    @partner = Partner.find(params[:id])