app/controllers/posts_controller.rb

  def index
    conditions = Array.new
    if !current_user
      conditions = ["published = ?", "t"]
    end
    @posts = Post.find_tagged_with(params[:tag], :conditions => conditions).reverse.paginate :page => params[:page] if params[:tag]
    @posts = Post.all(:conditions => conditions).reverse.paginate :page => params[:page] unless @posts
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 1) AND ("taggings".taggable_type = 'Post'))
SELECT * FROM "posts" WHERE (published == 1)
SELECT * FROM "posts" LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "posts"

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)

  def create
    @post = Post.new(params[:post])
    params[:post][:tag_list].split(',').each do |tag|
      @post.tag_list.add(tag.gsub(' ', ''))
    end
    if @post.save
---
INSERT INTO "posts" ("doc_content_type", "created_at", "title", "updated_at", "published", "content", "doc_updated_at", "doc_file_name", "doc_file_size") VALUES(NULL, '2010-03-22 18:19:16', 'etze', '2010-03-22 18:19:16', 'f', 'sgf ergfser g serg er', NULL, NULL, NULL)
INSERT INTO "tags" ("name") VALUES('ruby, linux')

  def update
    @post = Post.find(params[:id])
    if params[:post][:tag_list]
      @post.tag_list.each { |t| @post.tag_list.remove(t) }
    end
    params[:post][:tag_list].split(',').each do |tag|
      @post.tag_list.add(tag.gsub(' ', ''))
    end
    if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 3)
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 3) AND ("taggings".taggable_type = 'Post'))
UPDATE "posts" SET "updated_at" = '2010-03-17 14:13:15', "content" = 'This pattern splits the view (also called the presentation) into "dumb" templates that are primarily responsible for inserting pre-built data in between HTML tags. The model contains the "smart" domain objects (such as Account, Product, Person, Post) that holds all the business logic and knows how to persist themselves to a database. The controller handles the incoming requests (such as Save New Account, Update Product, Show Post) by manipulating the model and directing data to the view. ' WHERE "id" = 4

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
DELETE FROM "posts" WHERE "id" = 1

  def rss
    # Get the 10 most recent posts
    @posts = Post.find :all, :limit => 10, :order => 'created_at DESC'
---
SELECT * FROM "posts" ORDER BY created_at DESC LIMIT 10

  def file
    @post = Post.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5)