app/controllers/projects_controller.rb

  def index
    conditions = Array.new
    if !current_user
      conditions = ["published = ?", "t"]
    end
    @projects = Project.find_tagged_with(params[:tag], :conditions => conditions).reverse.paginate :page => params[:page] if params[:tag]
    @projects = Project.all(:conditions => conditions).reverse.paginate :page => params[:page] unless @projects
---
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 1) AND ("taggings".taggable_type = 'Project'))
SELECT * FROM "projects" WHERE (published = 't')
SELECT * FROM "projects"

  def show
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def create
    @project = Project.new(params[:project])
    params[:project][:tag_list].split(',').each do |tag|
      @project.tag_list.add(tag.gsub(' ', ''))
    end
    if @project.save
---
INSERT INTO "projects" ("name", "created_at", "updated_at", "url", "description") VALUES('WOw', '2010-03-17 15:08:01', '2010-03-17 15:08:01', 'http://github.com/mcansky', 'zefzef zeqf qzef')

  def edit
    @project = Project.find(params[:id])
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)

  def update
    @project = Project.find(params[:id])
    if params[:project][:tag_list]
      @project.tag_list.each { |t| @project.tag_list.remove(t) }
---
SELECT * FROM "projects" WHERE ("projects"."id" = 1)
SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 1) AND ("taggings".taggable_type = 'Project'))