app/controllers/users_controller.rb

SELECT * FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login", "email") VALUES('2010-03-17 11:57:00', '11f7c3c8bc07085f4595567a7be91c55a0394a90e88cbdcd20691f4c7da0081e6c6becd4c45e130cda520962c4c02ddc4a3bda8515dd6de646d21d823981f38e', '2010-03-17 11:57:00', 'lf8PmhcSBaViAwv4zJVK', 'b6752bf73b9b815e466f6cc58df1fdb2323bbbf3cc16a75b7bf625be144242cc82024fddafd6f1bcf601c84bd171c68136235059de495d7cbf536456984fa302', 'thomas', 'riboulet@gmail.com')
---
  def create
    redirect_to root_url unless (params[:user] && current_user) || User.all.size < 1
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = 1)
---
  def edit
    @user = User.find(params[:id])